package ex02_loop;

public class Ex03_for {

	public static void main(String[] args) {
		
		//for문
		//1.반복의 횟수나 범위가 명확할 때 사용합니다.
		//2.배열이나 리스트와 같은 반복기능객체(iterable)에서 사용합니다.
		//3.동작 순서
		//for(1; 2; 4){3}
		//1은 최초 1회만 동작합니다.
		//123는 반복합니다.
		
		/*
		//3번 "Hello Java"를 출력합니다.
		for(int n=0; n<3; n++) { //시작은 1로 잡아두는 경우는 없다 무조건 0으로 학습 하는 것 이 좋다.
			//사용되는 n : 0, 1, 2
			System.out.println("Hello Java");
			/*
			문제를 제대로 못들은것 집중 하기 대소문자를 만들어내라고 하는줄알고
			착각을 할번했다. 문제점 집중!
			*/
		}
		
		
		//1~10출력
		/*
		for(int n=1; n<=10; n++) { //1이 10보다 작을경우 n은 나중에 증가 시킨다.
			System.out.println(n);//나중에 증가시킬때라는것은 1을 조건 되고 1을 출력하고 
			//나중에 증가 한것에서 1을 증가시켜 2로 되어 2랑 10이 조건 보고 출력시키고 나중에 증가를 
			//출력하고 그때 증가시킨다 이것이 나중에 증가 이다.
		}
	}
		*/
}


